{
  "users": [
    {
      "firstName": "Joe",
      "lastName": "Smith",
      "emailAddress": "joe@smith.com",
      "password": "joepassword"
    },
    {
      "firstName": "Sally",
      "lastName": "Jones",
      "emailAddress": "sally@jones.com",
      "password": "sallypassword"
    }
  ],
  "courses": [
    {
      "userId": 1,
      "title": "Build a Basic Bookcase",
      "description": "High-end furniture projects are great to dream about. But unless you have a well-equipped shop and some serious woodworking experience to draw on, it can be difficult to turn the dream into a reality.\n\nNot every piece of furniture needs to be a museum showpiece, though. Often a simple design does the job just as well and the experience gained in completing it goes a long way toward making the next project even better.\n\nOur pine bookcase, for example, features simple construction and it's designed to be built with basic woodworking tools. Yet, the finished project is a worthy and useful addition to any room of the house. While it's meant to rest on the floor, you can convert the bookcase to a wall-mounted storage unit by leaving off the baseboard. You can secure the cabinet to the wall by screwing through the cabinet cleats into the wall studs.\n\nWe made the case out of materials available at most building-supply dealers and lumberyards, including 1/2 x 3/4-in. parting strip, 1 x 2, 1 x 4 and 1 x 10 common pine and 1/4-in.-thick lauan plywood. Assembly is quick and easy with glue and nails, and when you're done with construction you have the option of a painted or clear finish.\n\nAs for basic tools, you'll need a portable circular saw, hammer, block plane, combination square, tape measure, metal rule, two clamps, nail set and putty knife. Other supplies include glue, nails, sandpaper, wood filler and varnish or paint and shellac.\n\nThe specifications that follow will produce a bookcase with overall dimensions of 10 3/4 in. deep x 34 in. wide x 48 in. tall. While the depth of the case is directly tied to the 1 x 10 stock, you can vary the height, width and shelf spacing to suit your needs. Keep in mind, though, that extending the width of the cabinet may require the addition of central shelf supports.",
      "estimatedTime": "12 hours",
      "materialsNeeded": "* 1/2 x 3/4 inch parting strip\n* 1 x 2 common pine\n* 1 x 4 common pine\n* 1 x 10 common pine\n* 1/4 inch thick lauan plywood\n* Finishing Nails\n* Sandpaper\n* Wood Glue\n* Wood Filler\n* Minwax Oil Based Polyurethane\n"
    },
    {
      "userId": 2,
      "title": "Learn How to Program",
      "description": "In this course, you'll learn how to write code like a pro!\n\nProgramming is one of the most valuable skills you can pick up in these modern times, whether for career prospects or to stretch your brain and create something awesome. If you're just getting started on your coding journey, here are ten tips and resources to set you off on the right foot.\n\nMaster the languages of the web: HTML, CSS, and JavaScript. This path will prepare you to build basic websites and then build interactive web apps.\n\nWe'll also learn Python fundamentals, one of the hottest and fastest growing programming languages. This is a great introduction to the world of code.\n\nIf you're into Data Science then we'll also learn SQL and Python and build the skills you need to analyze data. Great for anyone trying to use code to be more data-driven.",
      "estimatedTime": "3 months",
      "materialsNeeded": "* Notebook computer running Mac OS X or Windows\n* Text editor"
    },
    {
      "userId": 2,
      "title": "Learn How to Test Programs",
      "description": "In this course, you'll learn how to test programs.\n\nSoftware touches just about everything in our world today. Today’s consumers expect intuitive and reliable technology, and in an increasingly crowded marketplace small missteps can trigger dissatisfaction and abandonment. Software testing addresses weaknesses in software development while building scalable development processes to ensure a best-in-class user experience. Learn the skills needed to excel as a Software Tester or Quality Assurance Engineer.\n\nIn this Software Testing and Verification course you will gain essential knowledge about software testing concepts and techniques and learn by delving into various software test cases and how they are documented. You will also learn how to plan, execute and manage software testing as well as software quality techniques for formal verification, which is used in mission critical projects.\n\nThis program will be of benefit to Software Testers, Developers and Quality Assurance Engineers. It will provide career-changers with the skills to get an entry-level job in Software Testing and help advance Software Developers skills in unit testing.",
      "estimatedTime": "6 weeks",
      "materialsNeeded": "* Notebook computer running Mac OS X or Windows\n* Text editor\n* Ready to learn attitude"
    },
    {
      "userId": 1,
      "title": "Master Microsoft Excel",
      "description": "In this course, you'll learn how to use Microsoft Excel.\n\nWhat you will learn:\n\nCourse 1: Data Analysis Fundamentals in Excel\n\nCourse 2: Visualizing Data in Excel\n\nCourse 3: Math and Statistics in Excel Online\n\n\n\nProgram Overview\n\nThe Excel Fundamentals will help you gain proficiency in Excel for a variety of uses, from pivot tables to decoding complex math formulas.\n\nExcel Fundamentals is a highly focused, standalone three-course series. Our approach combines self-directed online learning with hands-on labs, using the latest tools so you can hit the ground running.\n\nBy enrolling in a shorter program, you can more quickly gain a standalone Professional Certificate and the valuable analytics skills that employers are looking for—all at a 10 percent discount.",
      "estimatedTime": "6 weeks",
      "materialsNeeded": "* Notebook computer running Mac OS X or Windows\n* Microsoft Excel license"
    },
    {
      "userId": 2,
      "title": "Build a Wooden Gate",
      "description": "In this course, you'll learn how to build a basic wooden gate.\n\n\n1. Cut 2 x 4 (5.08 x 10.16 cm) frame pieces to size with a mitre saw. Start the gate by cutting the top and bottom pieces to the same width/length as you planned for, slightly smaller than the opening in the fence. Cut the upright side planks about 3 inches shorter than the height of the gate.\n\n\n2. Screw in the top and bottom planks. Drill a pilot hole for the screws before putting them in so that they do not split the wood. Fasten with deck screws, pre-drilling to keep the wood from splitting. Measure from the top bend to the opposite bottom corner. Both sides should measure the same.\n\nTypically, as you start assembling, the gate framing, it's good to lay it out on a flat surface, such as a patio or driveway. Attach the top and bottom rails to the side rails, making sure it is square.\n\n\n3. Cut an angled cross-brace and attach it to the top and bottom rails. This helps maintain strength and rigidity. Connect these to the frame boards that match the rest of the fence by using deck screws, pre-drilling as before.\n\nMake your diagonal cut with a mitre saw. Place the diagonal onto the box and trance with a pencil where the angles go.\n\nPlace the cross-brace at a 45 degree angle extending from the bottom corner of the gate to the opposite corner of the top of the gate.\n\n\n4. Cut and install the planks. Once you've designed the frame and built it, all you need to do now is attach flat planks evenly over the front of the frame to finish your basic wooden gate. Measure planks from the top to the bottom of the frame and cut them accordingly. Leave at least ⅛ inch between the planks for weather allowances.\n\nCut planks using a table saw and secure them using deck screws, drilling pilot holes to keep your planks nice and clean.\n\n\n5. Use your gate. After you finish sealing the wood and have given it plenty of time to dry, your gate is ready to use! Open and close it to test it out.",
      "estimatedTime": "6 hours",
      "materialsNeeded": "* Screwdriver\n* Power drill\n* compound miter saw\n* Carpenter's level\n* Jigsaw, for cutting a decorative profile\n* 3-inch stainless stell coated deck screws, for putting the box frame together\n* Hinges"
    },
    {
      "userId": 1,
      "title": "Learn How to Ride a Bike",
      "description": "In this course, you'll learn how to ride a bike.\n\n\n1. Scout a Location\n\nFind a slope about 20 feet high that's angled enough so the bike will coast down, but not so steep that it will be hard for your child to hold the bike still with his feet. There should be plenty of level ground at the bottom—about 20 yards in all directions.\n\n\n2. Safety Check and Bike Setup\n\nThe soft grass means less likelihood of skinned knees, but your child still needs a helmet. Avoid baggy clothing and tuck in her shoelaces before you get started. Here's the key bike setup trick: With a wrench, lower the saddle (that's cycling lingo for the seat) so your child's feet can rest flat on the ground as she sits.\n\n\n3. Roll Away\n\nAbout halfway up the hill, position the bike with the pedals level. Put your child on the saddle with his feet on the ground, holding the handlebar straight and arms slightly bent. Have him lift his feet and roll to the bottom of the hill, controlling the speed by putting his feet back on the ground, if needed. Walk the bike back up and repeat until your child can keep his feet on the pedals while coasting down. Once your child has more confidence, move higher on the hill and repeat a couple more times.\n\n\n4. Add Braking and Steering\n\nTell your child to apply the brake after the hill levels out. When she can stop safely, work on steering with gentle turns to the left and right. Repeat riding down the hill, turning each direction at the bottom two or three times.\n\n\n5. Raise the Saddle, and Pedal\n\nRaise the saddle high enough to allow a slight bend in your child's leg when the pedal is at the bottom of a stroke. Start partway up the hill and have him coast until the bottom of the hill, then pedal while riding circles in the level area. Allow a proud smile to cross your face because your child is now riding a bike.\n\n\n6. Helment Safety\n\nIt's critical to teach your child the importance of helmet safety at the same time you're teaching beginning cycling skills. The Consumer Products Safety Commission notes that wearing a bike helmet can reduce your child's risk of head injury by 85 percent. Make sure the helmet is level when worn, not tilted back or angled to one side. The side straps should form a snug 'V' under each ear, and the chin strap should be cinched enough to allow you to slide only two fingers underneath. Many young children put their helmets on backward, so make sure they know which is the rear and which is the front. There's usually a sticker inside pointing in right direction.",
      "estimatedTime": "1-2 weeks practice",
      "materialsNeeded": "* A Bike to suit your height\n* Helment\n* Open space"
    }
  ]
}